Autodesk.Revit.DB.ElementIsCurveDrivenFilter.#ctor(System.Boolean)
Constructs a new instance of a filter to match only curve driven elements, with the option to match all elements which are not curve driven elements.
Remarks:
The term "curve driven" indicates that the element's Location property is a LocationCurve.
Example elements found by this filter include walls, beams, and curve elements.
inverted:
True if the filter should match all elements which are not curve driven elements.
Since:
2011

Autodesk.Revit.DB.ElementIsCurveDrivenFilter.#ctor
Constructs a new instance of a filter to match only curve driven elements.
Remarks:
The term "curve driven" indicates that the element's Location property is a LocationCurve.
Example elements found by this filter include walls, beams, and curve elements.
Since:
2011

Autodesk.Revit.DB.ElementIsCurveDrivenFilter
A filter used to match elements which are curve driven.
Remarks:
The term "curve driven" indicates that the element's Location property is a LocationCurve.
Example elements found by this filter include walls, beams, and curve elements.
This filter is a quick filter.
Quick filters operate only on the ElementRecord, a low-memory class which has
a limited interface to read element properties. Elements which are rejected
by a quick filter will not be expanded in memory.
Since:
2011